# 문제: 01타일 (실버 3)
'''
------------------------

N = 1 : 1
N = 2 : 00 11
N = 3 : 001 100 111 

2   0000 1100
3   0011 1001 1111


N = 4 : 0000 0011 1001 1100 1111 

3   00100 10000 11100
4   00001 00111 10011 11001 11111

N = 5 : 00001 00100 10000 00111 10011 11001 11100 11111


<<n번째 = n-2번째에서 빈칸 2칸 채우기(00) + n-1번째에서 빈칸 1칸 채우기(1)>>

f(n) = f(n-1)+f(n-2)
------------------------
<모듈러 연산 법칙>

1. (a + b) % m = ((a % m) + (b % m)) % m
2. (a * b) % m = ((a % m) * (b % m)) % m

이거 모르면 고민이 심해지니까 꼭 염두에 두기!

'''
import sys
input = sys.stdin.readline

n = int(input())

tail = [0, 1, 2] + [0]*n

for i in range(3,n+1):
    tail[i] = (tail[i-1]+ tail[i-2])%15746
print(tail[n])


